irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_sdio_4867_IUT.c
  uint32_t tmpreg = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);



  tmpreg = ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->CLKCR;


  tmpreg &= ((uint32_t)0xFFFF8100);







  tmpreg |= (SDIO_InitStruct->SDIO_ClockDiv | SDIO_InitStruct->SDIO_ClockPowerSave |
             SDIO_InitStruct->SDIO_ClockBypass | SDIO_InitStruct->SDIO_BusWide |
             SDIO_InitStruct->SDIO_ClockEdge | SDIO_InitStruct->SDIO_HardwareFlowControl);


  ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->CLKCR = tmpreg;

CS_CMM_PROBE_NODE_STMT(163,2,1) 
 CODESCROLL_FUNC_END(294, 20, 210) } CODESCROLL_FUNC_END_RBRACE 







void SDIO_StructInit(SDIO_InitTypeDef* SDIO_InitStruct)
{ CODESCROLL_FUNC_BEGIN(295, (295, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable770,742) 

  
  CS_CMM_PROBE_NODE_STMT(163,1,0) SDIO_InitStruct->SDIO_ClockDiv = 0x00;
  SDIO_InitStruct->SDIO_ClockEdge = ((uint32_t)0x00000000);
  SDIO_InitStruct->SDIO_ClockBypass = ((uint32_t)0x00000000);
  SDIO_InitStruct->SDIO_ClockPowerSave = ((uint32_t)0x00000000);
  SDIO_InitStruct->SDIO_BusWide = ((uint32_t)0x00000000);
  SDIO_InitStruct->SDIO_HardwareFlowControl = ((uint32_t)0x00000000);

CS_CMM_PROBE_NODE_STMT(163,0,1) 
 CODESCROLL_FUNC_END(295, 20, 227) } CODESCROLL_FUNC_END_RBRACE 






void SDIO_ClockCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(296, (296, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable771,743) 

  
  CS_CMM_PROBE_NODE_STMT(164,7,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x18000) - ((uint32_t)0x40000000)) + 0x04) * 32) + (0x08 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(164,6,1) 
 CODESCROLL_FUNC_END(296, 20, 240) } CODESCROLL_FUNC_END_RBRACE 
/* # 250 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
void SDIO_SetPowerState(uint32_t SDIO_PowerState)
{ CODESCROLL_FUNC_BEGIN(297, (297, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable772,744) 

  
  CS_CMM_PROBE_NODE_STMT(164,5,0) ((void)0);

  ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->POWER &= ((uint32_t)0xFFFFFFFC);
  ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->POWER |= SDIO_PowerState;

CS_CMM_PROBE_NODE_STMT(164,4,1) 
 CODESCROLL_FUNC_END(297, 20, 257) } CODESCROLL_FUNC_END_RBRACE 
/* # 268 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
uint32_t SDIO_GetPowerState(void)
{ CODESCROLL_FUNC_BEGIN(298, (298, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable773,745) 
  
  CS_CMM_PROBE_NODE_STMT(164,3,0) 
  CS_CMM_PROBE_NODE_STMT(164,2,1) 
   CODESCROLL_FUNC_END(298, 20, 270) return (((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->POWER & (~((uint32_t)0xFFFFFFFC)));
} CODESCROLL_FUNC_END_RBRACE 
/* # 306 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
void SDIO_ITConfig(uint32_t SDIO_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(299, (299, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable774,746) 

  
  CS_CMM_PROBE_NODE_STMT(164,1,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(164,0,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable775,747) 

    
    CS_CMM_PROBE_NODE_STMT(165,7,2) ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->MASK |= SDIO_IT;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable776,748) 

    
    CS_CMM_PROBE_NODE_STMT(165,6,3) ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->MASK &= ~SDIO_IT;
  }

CS_CMM_PROBE_NODE_STMT(165,5,4) 
 CODESCROLL_FUNC_END(299, 20, 322) } CODESCROLL_FUNC_END_RBRACE 







void SDIO_DMACmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(300, (300, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable777,749) 

  
  CS_CMM_PROBE_NODE_STMT(165,4,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x18000) - ((uint32_t)0x40000000)) + 0x2C) * 32) + (0x03 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(165,3,1) 
 CODESCROLL_FUNC_END(300, 20, 336) } CODESCROLL_FUNC_END_RBRACE 
/* # 345 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
void SDIO_SendCommand(SDIO_CmdInitTypeDef *SDIO_CmdInitStruct)
{ CODESCROLL_FUNC_BEGIN(301, (301, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable778,750) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable779,165,2,0)

  uint32_t tmpreg = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);



  ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->ARG = SDIO_CmdInitStruct->SDIO_Argument;



  tmpreg = ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->CMD;

  tmpreg &= ((uint32_t)0xFFFFF800);




  tmpreg |= (uint32_t)SDIO_CmdInitStruct->SDIO_CmdIndex | SDIO_CmdInitStruct->SDIO_Response
           | SDIO_CmdInitStruct->SDIO_Wait | SDIO_CmdInitStruct->SDIO_CPSM;


  ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->CMD = tmpreg;

CS_CMM_PROBE_NODE_STMT(165,1,1) 
 CODESCROLL_FUNC_END(301, 20, 373) } CODESCROLL_FUNC_END_RBRACE 







void SDIO_CmdStructInit(SDIO_CmdInitTypeDef* SDIO_CmdInitStruct)
{ CODESCROLL_FUNC_BEGIN(302, (302, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable780,751) 

  
  CS_CMM_PROBE_NODE_STMT(165,0,0) SDIO_CmdInitStruct->SDIO_Argument = 0x00;
  SDIO_CmdInitStruct->SDIO_CmdIndex = 0x00;
  SDIO_CmdInitStruct->SDIO_Response = ((uint32_t)0x00000000);
  SDIO_CmdInitStruct->SDIO_Wait = ((uint32_t)0x00000000);
  SDIO_CmdInitStruct->SDIO_CPSM = ((uint32_t)0x00000000);

CS_CMM_PROBE_NODE_STMT(166,7,1) 
 CODESCROLL_FUNC_END(302, 20, 389) } CODESCROLL_FUNC_END_RBRACE 






