irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_sdio_4867_IUT.c
uint8_t SDIO_GetCommandResponse(void)
{ CODESCROLL_FUNC_BEGIN(303, (303, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable781,752) 
  
  CS_CMM_PROBE_NODE_STMT(166,6,0) 
  CS_CMM_PROBE_NODE_STMT(166,5,1) 
   CODESCROLL_FUNC_END(303, 20, 398) return (uint8_t)(((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->RESPCMD);
} CODESCROLL_FUNC_END_RBRACE 
/* # 411 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
uint32_t SDIO_GetResponse(uint32_t SDIO_RESP)
{ CODESCROLL_FUNC_BEGIN(304, (304, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable782,753) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable783,166,4,0)

  volatile uint32_t tmp = 0;


  ((void)0);

  tmp = ((uint32_t)((((uint32_t)0x40000000) + 0x18000) + 0x14)) + SDIO_RESP;

  
  CS_CMM_PROBE_NODE_STMT(166,3,1) 
   CODESCROLL_FUNC_END(304, 20, 420) return (*(volatile uint32_t *) tmp);
} CODESCROLL_FUNC_END_RBRACE 
/* # 430 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
void SDIO_DataConfig(SDIO_DataInitTypeDef* SDIO_DataInitStruct)
{ CODESCROLL_FUNC_BEGIN(305, (305, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable784,754) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable785,166,2,0)

  uint32_t tmpreg = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);



  ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->DTIMER = SDIO_DataInitStruct->SDIO_DataTimeOut;



  ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->DLEN = SDIO_DataInitStruct->SDIO_DataLength;



  tmpreg = ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->DCTRL;

  tmpreg &= ((uint32_t)0xFFFFFF08);




  tmpreg |= (uint32_t)SDIO_DataInitStruct->SDIO_DataBlockSize | SDIO_DataInitStruct->SDIO_TransferDir
           | SDIO_DataInitStruct->SDIO_TransferMode | SDIO_DataInitStruct->SDIO_DPSM;


  ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->DCTRL = tmpreg;

CS_CMM_PROBE_NODE_STMT(166,1,1) 
 CODESCROLL_FUNC_END(305, 20, 463) } CODESCROLL_FUNC_END_RBRACE 







void SDIO_DataStructInit(SDIO_DataInitTypeDef* SDIO_DataInitStruct)
{ CODESCROLL_FUNC_BEGIN(306, (306, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable786,755) 

  
  CS_CMM_PROBE_NODE_STMT(166,0,0) SDIO_DataInitStruct->SDIO_DataTimeOut = 0xFFFFFFFF;
  SDIO_DataInitStruct->SDIO_DataLength = 0x00;
  SDIO_DataInitStruct->SDIO_DataBlockSize = ((uint32_t)0x00000000);
  SDIO_DataInitStruct->SDIO_TransferDir = ((uint32_t)0x00000000);
  SDIO_DataInitStruct->SDIO_TransferMode = ((uint32_t)0x00000000);
  SDIO_DataInitStruct->SDIO_DPSM = ((uint32_t)0x00000000);

CS_CMM_PROBE_NODE_STMT(167,7,1) 
 CODESCROLL_FUNC_END(306, 20, 480) } CODESCROLL_FUNC_END_RBRACE 






uint32_t SDIO_GetDataCounter(void)
{ CODESCROLL_FUNC_BEGIN(307, (307, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable787,756) 
  
  CS_CMM_PROBE_NODE_STMT(167,6,0) 
  CS_CMM_PROBE_NODE_STMT(167,5,1) 
   CODESCROLL_FUNC_END(307, 20, 489) return ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->DCOUNT;
} CODESCROLL_FUNC_END_RBRACE 






uint32_t SDIO_ReadData(void)
{ CODESCROLL_FUNC_BEGIN(308, (308, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable788,757) 
  
  CS_CMM_PROBE_NODE_STMT(167,4,0) 
  CS_CMM_PROBE_NODE_STMT(167,3,1) 
   CODESCROLL_FUNC_END(308, 20, 499) return ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->FIFO;
} CODESCROLL_FUNC_END_RBRACE 






void SDIO_WriteData(uint32_t Data)
{ CODESCROLL_FUNC_BEGIN(309, (309, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable789,758) 
  
  CS_CMM_PROBE_NODE_STMT(167,2,0) ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->FIFO = Data;

CS_CMM_PROBE_NODE_STMT(167,1,1) 
 CODESCROLL_FUNC_END(309, 20, 510) } CODESCROLL_FUNC_END_RBRACE 






uint32_t SDIO_GetFIFOCount(void)
{ CODESCROLL_FUNC_BEGIN(310, (310, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable790,759) 
  
  CS_CMM_PROBE_NODE_STMT(167,0,0) 
  CS_CMM_PROBE_NODE_STMT(168,7,1) 
   CODESCROLL_FUNC_END(310, 20, 519) return ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->FIFOCNT;
} CODESCROLL_FUNC_END_RBRACE 







void SDIO_StartSDIOReadWait(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(311, (311, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable791,760) 

  
  CS_CMM_PROBE_NODE_STMT(168,6,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x18000) - ((uint32_t)0x40000000)) + 0x2C) * 32) + (0x08 * 4)) = (uint32_t) NewState;

CS_CMM_PROBE_NODE_STMT(168,5,1) 
 CODESCROLL_FUNC_END(311, 20, 534) } CODESCROLL_FUNC_END_RBRACE 







void SDIO_StopSDIOReadWait(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(312, (312, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable792,761) 

  
  CS_CMM_PROBE_NODE_STMT(168,4,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x18000) - ((uint32_t)0x40000000)) + 0x2C) * 32) + (0x09 * 4)) = (uint32_t) NewState;

CS_CMM_PROBE_NODE_STMT(168,3,1) 
 CODESCROLL_FUNC_END(312, 20, 548) } CODESCROLL_FUNC_END_RBRACE 
/* # 558 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
void SDIO_SetSDIOReadWaitMode(uint32_t SDIO_ReadWaitMode)
{ CODESCROLL_FUNC_BEGIN(313, (313, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable793,762) 

  
