irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_sdio_4867_IUT.c
  CS_CMM_PROBE_NODE_STMT(168,2,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x18000) - ((uint32_t)0x40000000)) + 0x2C) * 32) + (0x0A * 4)) = SDIO_ReadWaitMode;

CS_CMM_PROBE_NODE_STMT(168,1,1) 
 CODESCROLL_FUNC_END(313, 20, 564) } CODESCROLL_FUNC_END_RBRACE 







void SDIO_SetSDIOOperation(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(314, (314, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable794,763) 

  
  CS_CMM_PROBE_NODE_STMT(168,0,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x18000) - ((uint32_t)0x40000000)) + 0x2C) * 32) + (0x0B * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(169,7,1) 
 CODESCROLL_FUNC_END(314, 20, 578) } CODESCROLL_FUNC_END_RBRACE 







void SDIO_SendSDIOSuspendCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(315, (315, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable795,764) 

  
  CS_CMM_PROBE_NODE_STMT(169,6,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x18000) - ((uint32_t)0x40000000)) + 0x0C) * 32) + (0x0B * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(169,5,1) 
 CODESCROLL_FUNC_END(315, 20, 592) } CODESCROLL_FUNC_END_RBRACE 







void SDIO_CommandCompletionCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(316, (316, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable796,765) 

  
  CS_CMM_PROBE_NODE_STMT(169,4,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x18000) - ((uint32_t)0x40000000)) + 0x0C) * 32) + (0x0C * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(169,3,1) 
 CODESCROLL_FUNC_END(316, 20, 606) } CODESCROLL_FUNC_END_RBRACE 






void SDIO_CEATAITCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(317, (317, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable797,766) 

  
  CS_CMM_PROBE_NODE_STMT(169,2,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x18000) - ((uint32_t)0x40000000)) + 0x0C) * 32) + (0x0D * 4)) = (uint32_t)((~((uint32_t)NewState)) & ((uint32_t)0x1));

CS_CMM_PROBE_NODE_STMT(169,1,1) 
 CODESCROLL_FUNC_END(317, 20, 619) } CODESCROLL_FUNC_END_RBRACE 






void SDIO_SendCEATACmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(318, (318, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable798,767) 

  
  CS_CMM_PROBE_NODE_STMT(169,0,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x18000) - ((uint32_t)0x40000000)) + 0x0C) * 32) + (0x0E * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(170,7,1) 
 CODESCROLL_FUNC_END(318, 20, 632) } CODESCROLL_FUNC_END_RBRACE 
/* # 665 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
FlagStatus SDIO_GetFlagStatus(uint32_t SDIO_FLAG)
{ CODESCROLL_FUNC_BEGIN(319, (319, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable799,768) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable800,170,6,0)

  FlagStatus bitstatus = RESET;


  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(170,5,1) if ((((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->STA & SDIO_FLAG) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable801,769) 
    
    CS_CMM_PROBE_NODE_STMT(170,4,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable802,770) 
    
    CS_CMM_PROBE_NODE_STMT(170,3,3) bitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(170,2,4) 
   CODESCROLL_FUNC_END(319, 20, 680) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 703 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
void SDIO_ClearFlag(uint32_t SDIO_FLAG)
{ CODESCROLL_FUNC_BEGIN(320, (320, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable803,771) 

  
  CS_CMM_PROBE_NODE_STMT(170,1,0) ((void)0);

  ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->ICR = SDIO_FLAG;

CS_CMM_PROBE_NODE_STMT(170,0,1) 
 CODESCROLL_FUNC_END(320, 20, 709) } CODESCROLL_FUNC_END_RBRACE 
/* # 742 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
ITStatus SDIO_GetITStatus(uint32_t SDIO_IT)
{ CODESCROLL_FUNC_BEGIN(321, (321, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable804,772) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable805,171,7,0)

  ITStatus bitstatus = RESET;


  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(171,6,1) if ((((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->STA & SDIO_IT) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable806,773) 
    
    CS_CMM_PROBE_NODE_STMT(171,5,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable807,774) 
    
    CS_CMM_PROBE_NODE_STMT(171,4,3) bitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(171,3,4) 
   CODESCROLL_FUNC_END(321, 20, 756) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 778 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_sdio.c"*/
void SDIO_ClearITPendingBit(uint32_t SDIO_IT)
{ CODESCROLL_FUNC_BEGIN(322, (322, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable808,775) 

  
  CS_CMM_PROBE_NODE_STMT(171,2,0) ((void)0);

  ((SDIO_TypeDef *) (((uint32_t)0x40000000) + 0x18000))->ICR = SDIO_IT;

CS_CMM_PROBE_NODE_STMT(171,1,1) 
 CODESCROLL_FUNC_END(322, 20, 784) } CODESCROLL_FUNC_END_RBRACE 
